a = 
    {
        more: '➡ Ставки на Больше 7:\n' +
          '@id297789589(Крис) → 10 🎲\n' +
          '\n' +
          '@id297789589(Крис) → 1 000 🎲\n',
        seven: '🔵 Ставки на 7:\n' +
          '@id297789589(Крис) → 10 🎲\n' +
          '\n' +
          '@id297789589(Крис) → 40 🎲\n' +
          '\n' +
          '@id297789589(Крис) → 1 000 000 🎲\n',
        less: '⬅ Ставки на Меньше 7:\n' +
          '@id297789589(Крис) → 10 🎲\n' +
          '\n' +
          '@id297789589(Крис) → 100 🎲\n',
        even: '\n\n⚡ Ставки на Чётное:\n' +
          '@id297789589(Крис) → 100 🎲\n' +
          '\n' +
          '@id297789589(Крис) → 500 🎲\n',
        odd: '\n\n⚡ Ставки на Нечётное:\n@id297789589(Крис) → 500 🎲\n'
      }
      


b = Object.entries(a)
console.log(b[0][1])