const { Keyboard } = require("vk-io")
const { wheelBoard, doubleBoard, diceBoard, cubeBoard, l7mBoard } = require("../../keyboards/usual")

const gamePayloadsTranslate = {
    '1-12': ['1&#8419;', '1-12', '1&#8419; Ставки на 1-12:'],
    '13-24': ['2&#8419;', '13-24', '2&#8419; Ставки на 13-24'],
    '25-36': ['3&#8419;', '25-36', '3&#8419; Ставки на 25-36:'],
    'red': ['🔴', 'Красное', '🔴 Ставки на Красное:'],
    'black': ['⚫', 'Чёрное', '⚫ Ставки на Чёрное'],
    'zero': ['🟢', '0', '🟢 Ставки на 0:'],
    'even': ['⚡', 'Чётное', '⚡ Ставки на Чётное:'],
    'odd':['⚡', 'Нечётное', '⚡ Ставки на Нечётное:'],
    'one': ['1&#8419;', '1', '1&#8419; Ставки на 1:'],
    'two': ['2&#8419;', '2', '2&#8419; Ставки на 2:'],
    'three': ['3&#8419;', '3', '3&#8419; Ставки на 3:'],
    'four': ['4&#8419;', '4', '4&#8419; Ставки на 4:'],
    'five': ['5&#8419;', '5', '5&#8419; Ставки на 5:'],
    'six': ['6&#8419;', '6', '6&#8419; Ставки на 6:'],
    'golden': ['🟡', 'Золото', '🟡 Ставки на Золото:'],
    'white': ['⚪', 'Белое', '⚪ Ставки на Белое:'],
    '1-4': ['1&#8419;', '1-4', '1&#8419; Ставки на 1-4:'],
    '5-8': ['2&#8419;', '5-8', '2&#8419; Ставки на 5-8:'],
    '9-12': ['3&#8419;', '9-12', '3&#8419; Ставки на 9-12:'],
    '2X': ['🔵', '2X', '🔵 Ставки на 2X:'],
    '3X': ['🟢', '3X', '🟢 Ставки на 3X:'],
    '5X': ['🔴', '5X', '🔴 Ставки на 5X:'],
    '10X': ['🟣', '10X', '🟣 Ставки на 10X:'],
    'more': ['➡', 'Больше 7', '➡ Ставки на Больше 7:'],
    'seven': ['🔵', '7', '🔵 Ставки на 7:'],
    'less': ['⬅', 'Меньше 7', '⬅ Ставки на Меньше 7:']
}

module.exports = { gamePayloadsTranslate  }